#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<string.h>
//***************指针*********************
// 结论：指针大小在32位平台是4个字节，64位平台是8个字节
int main()
{
	char ch = 'w';
	char* pc = &ch;
	//*pc = 'a';
	//printf("%c\n", ch);
	printf("%d\n", sizeof(pc));
	return 0;
}

//int main()
//{
//	int a = 10;//4个字节
//	int* p = &a;//取地址a
//	/*printf("%p\n", &a);
//	printf("%p\n", p);*/
//	*p = 20;//* - 解引用操作符
//	printf(" a = %d\n", a);
//	//有一种变量是用来存放地址的-指针变量
//	//printf("%p\n", &a);
//
//	return 0;
//}


//***************#define定义常量和宏*********************
#include<stdio.h>

//#define 定义标识符常亮
/*#define MAX 100*/ 
//#define 可以定义宏-带参数


////函数的实现
//Max(int x, int y)
//{
//	if (x > y)
//		return x;
//	else
//		return y;
//}
//
////宏的定义
//#define MAX(X,Y) (X>Y?X:Y)
//int main()
//{
//	/*int a = MAX;*/
//	int a = 10;
//	int b = 20;
//	//函数
//	int max = Max(a, b);
//	printf("max= %d\n", max);
//	//宏的方式
//	max = MAX(a, b);
//	//max = (a>b?a:b);
//	printf("max= %d\n", max);
//	return 0;
//}



//***************static*********************
//static 修饰局部变量
//局部变量的生命周期变长

//void test()
//{
//	static int a = 1;//加上static,a此时是一个静态的局部变量
//	a++;
//	printf("a = %d\n", a);
//}
//int main()
//{
//	int i = 0;
//	while (i < 5)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}
//static 修饰全局变量
//改变了变量的作用域 - 让静态的全局变量只能再自己所在的源文件内部使用
// 出了源文件就没办法再使用
//
//int main()
//{
//	//extern - 声明外部符号的
//	extern int g_val;
//	printf("g_val = %d\n", g_val);
//	return 0;
//}
//static 修饰函数 也是改变了函数的作用域-不准确
//static修饰函数改变了函数的链接属性
//普通函数是有外部链接属性的，如果被static修饰了，外部链接属性就变为了内部链接属性
//

// 声明外部函数
//extern int Add(int, int);
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int sum = Add(a, b);
//	printf("sum = %d\n", sum);
//	return 0;
//}

//***************typedef*********************
//int main()
//{
//	//typedef - 类型定义 - 类型重定义名字
//	//张三 -- 小三 --
//	typedef unsigned int u_int;//把unsigned类型 定义为 u_int
//	unsigned int num = 20;
//	u_int num2 = 20;
//
//	return 0;
//}


//int main()
//{
//	//register int a = 10;//建议把a定义成寄存器变量
//	int a = 10;
//	a = -2;
//	//int 定义的变量是有符号的
//	//signed int;
//	unsigned int num = -1;
//	return 0;
//}


////int  float
//int main()
//{
//    int a = 10;//局部变量-自动变量  局部变量前都会有 auto, 一般都会省略
//	return 0;
//}

//int Add(int x, int y)
//{
//	int z = 0;
//	z = x + y;
//	return z;
//}
//int main()
//{
//	//int arr[10] = { 0 };
//	//arr[4];//[]  - 下标引用操作符
//	int a = 10;
//	int b = 20;
//	int sum = Add(a, b);//() - 函数调用操作符
//	printf("sum= %d\n", sum);
//	return 0;
//}

//***************条件操作符*********************
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//
//	max = (a > b ? a : b);//三目操作符也叫条件操作符   exp1?exp2:exp3
//	//此处？为判断；a>b 如果为真，执行a,并赋值给max；如果为假，执行b,并赋值给max
//	if (a > b)
//		max = a;
//	else
//		max = b;
//	
//	return 0;
//}

//****************逻辑操作符*********************
//int main()
//{
//	//真  - 非零
//	//假  - 零
//	//&& - 逻辑与
//	//|| - 逻辑或
//	int a = 3;
//	int b = 5;
//	/*int c = a && b; */ //结果为  1
//	int c = a || b;  // 结果为  1
//
//	printf("c = %d\n", c);
//	
//	return 0;
//}

//***************++和--**************************
//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++，先使用，再++
//	//int b = ++a;//前置++，先++，再使用
//	//int b = a--;//后置--，先使用，再--
//	int b = --a;//前置--，先--，再使用
//	printf("a = %d b = %d\n", a, b);
//	//1、a=11 b=10  
//	//2、a=11 b=11
//	//3、a=9  b=10
//	//4、a=9  b=9
//	return 0;
//}
//*************原码  反码  补码*******************
//只要是整数，内存中存储的都是二进制的补码
// 正数--原码，反码，补码 相同
// 负数：
// 原码                    -->                      反码         -->           补码
// 原码是直接按照正负     反码是原码的符号位不变                反码+1
// 直接写出二进制序列     其他位取反所得到的
// -2
// 1000000000000000000000000000010  - 原码
// 1111111111111111111111111111101  - 反码
// 1111111111111111111111111111110  - 补码
// 
// -1 - 整形 -32
// 1  - 整形 -32
// 最高位数字1或0判断正负 1 为负数  0 为正数
// [1][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]
// [0][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]
// 
// 
//int main()
//{
//	int a = 0;// 整形占用4个字节，32个bit位
//	int b = ~a;
//	// ~ -> 按（二进制）位取反
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111
//	//原码、反码、补码
//	// 负数在内存中存储的时候，存储的是二进制的补码
//	// 11111111111111111111111111111111
//	// 11111111111111111111111111111110
//	// 10000000000000000000000000000001
//	//
//	printf("%d\n", b);//使用的、打印的是这个数的原码
//  打印结果为  -1
//
//	return 0;
//}


// ***sizeof***  
//int main()
//{
//	int a = 10;
//	int arr[] = { 1, 2, 3, 4, 5, 6 };//6个字符*4个字节=24 --> int[6]
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof(int));//4
//	printf("%d\n", sizeof a);//4
//    //printf("%d\n", sizeof int);//err
//	printf("%d\n", sizeof(arr));//通过sizeof可以计算数组的大小，单位是字节
//	printf("%D\n",sizeof(arr) / sizeof(arr[0]));//6
//
//	return 0;
//}


//***************注释风格*******************
//C  注释 /*xxxxxxxxx*/  缺陷：不能嵌套注释
//C++注释 //xxxxxxxxxxx  缺陷：可以注释一行也可以注释多行

//*****************操作符*****************
//**单目操作符**
// ！      逻辑反操作
// -       负值
// +       正值
// &       取地址
// sizeof  操作数的类型长度（以字节为单位）
// ~       对一个数的二进制按位取反
// --      前置、后置--
// ++      前置、后置++
// *       间接访问操作符（解引用操作符）
// (类型)  强制类型转换
//**双目操作符**
//**三目操作符**
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a + b;// + 双目操作符
//	return 0;
//}
	
//***!***
//int main()
//{
//	int a = 0;
//	printf("%d\n", a);
//	printf("%d\n", !a);
//	C语言中我们表示真假
//	  0 - 假
//	非0 - 真 
//  return 0;
//}
	//***-***
//int main()
//{
//    int a = -2;
//	int b = -a;
//	int c = +3;//+号会省略
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%d\n", c);
//
//    return 0;
//}

//**赋值操作符**
//+=  -=  *=  /=  %=  >>=  <<=  &= |=  ^=
// int main()
//{
//	int a = 10;
//	a = 20;//= 赋值    ==判断相等
//	a = a + 10;//第一种写法
//	a += 10;//第二种写法
//	a = a - 20;
//	a -= 20;
//	a = a & 2;
//	a &= 2;
// 
//	return 0;
//}

 
// 
// 
//int main()
//{
//	int arr[10] = { 0 };//10个整型元素的数组
//	int sz = 0;
//	//10*sizeof(int)=40
//	printf("%d\n", sizeof(arr));
//	//计算数组的元素个数
//	//数组总大小/每个元素的大小
//	sz = sizeof(arr) / sizeof(arr[0]);
//		printf("sz = %d\n", sz);
//	//int a = 10;
//	////sizeof 计算的事变量/类型所占空间的大小，单位是字节
//	//printf("%d\n", sizeof(a));//a占4个字节
//	//printf("%d\n", sizeof(int));
//	//printf("%d\n", sizeof a);//去括号a仍然能运行表达
//	////printf("%d\n", sizeof int);err
//	return 0;
//}


//真  - 非0
//假  - 0 
//int main()
//{
//	//(2进制)位操作
//	//& 按位 与   = 一假即假，全真才真
//	//| 按位 或   = 一真即真，全假才假
//	//^ 按位 异或 = 对应的二进制位相同为0，对应的二进制位相异为1
////**异或**
//	//int a = 3;
//	//int b = 5;
//	//int c = a ^ b;
//	//011
//	//101
//	//110 = 6
////**或**
//	/*int a = 3;
//	int b = 5;
//	int c = a | b;*/
//	//011
//	//101
//	//111 = 7
////**与**
//	//int a = 3;//011
//	//int b = 5;//101
//	//int c = a & b;
//	////011
//	////101
//	////001 = 1
//	printf("%d\n", c);
//	return 0;
//}


//********************************************************************
//int main()
//{
//	//移（2进制位）位操作符
//	//<< 左移
//	//>> 右移
//	int a = 1;
//	//整形1 占4个字节 - 32bit位
//	//0000000000000000000000000001
//	int b = a << 1;
//	printf("%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = 5 % 2;//%-取模
//	printf("%d ", a);
//	return 0;
//}

//*********************循环语句************************
//
//数组通过下标使用
//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//int c = 3;
//	//int d = 4;
//	int  arr[10] = {1,2,3,4,5,6,7,8,9,10};//定义一个存放10个整数数字的数组
//	//下标0-9
//	int i = 0;
//	while (i<10)
//	{
//		printf("%d ", arr[i]);
//		i++;
//	}
//	//printf("%d\n", arr[4]);//以下标的方式访问元素			 
//	/*char ch[20];
//	float arr2[5];*/
//	return 0;
//}


//int Add(int x, int y)
//{
//	int z = x + y;
//	return z;
//}
//int main()
//{
//	int num1 = 10;
//	int num2 = 20;
//	int sum = 0;
//	int a = 100;
//	int b = 200;
//	sum = Add(num1, num2);
//	sum = Add(a, b);
//	sum = Add(2, 3);
//	/*sum = num1 + num2;
//	sum = a + b;*/
//	printf("sum = %d\n",sum);
//
//	return 0;
//}


//while语句
//int main()
//{
//	int line = 0;
//	printf("好好学习\n");
//
//	while (line<20000)
//	{
//		printf("敲一行代码: %d\n", line); 
//        line++;
//	}
//
//	if(line>=20000)
//	    printf("好offer\n");
//	return 0;
//}


//********************************************************************
//int main()
//{
//	int input = 0;
//	printf("你会好好学习嘛？(0/1)>: ");
//	scanf("%d", &input);//  1/0
//	if (input == 1)
//		printf("好offer\n");
//	else
//		printf("卖红薯\n");
//	return 0;
//}

//*********************转义字符****************************
//*****重点*****  
	// \ddd   ddd表示1~3个八进制的数字，如：\130 X 
	// \xdd   dd表示2个十六进制数字,如：\x30 0
//常见ASCII码值
// 十进制  字符     十进制  字符     十进制  字符
// 48      0         65      A        97      a
// 49      1         66      B        98      b
// ...     ...       ...     ...      ...     ...
// 57      9         90      Z        122     z
//int main()
//{
//	/*printf("%d\n", strlen("c:\test\32\test.c"));*/
//	// c,:,\t,e,s,t,\32,\t,e,s,t,.,c. 长度13
//	// \32 -- 32是2个8进制数字
//	//32作为8进制代表的那个十进制数字，作为ASCII码值，对应的字符
//	//32 -- > 10进制 26 -> 作为ASCII码值代表的字符
//	/*printf("%c\n", '\32');*/
//	//打印结果为“→”，如果是个方框，右键程序控制框，点击属性，字体选择“点阵字体”
//	printf("%c\n", '\x61');
//	
//	// \x61 为十六进制 打印结果为 a
//	return 0;
//}

//int main()
//{
//	/*printf("c:\\test\\32\\test.c");*/
//	/*printf("%c\n", '\'');*/
//	/*printf("%s\n", "\"");*/
//	// \t - 水平制表符
//	return 0;
//}
//不加"\\" 打印结果  
//打印结果 '
//打印结果 "
//int main()
//{
//	printf("abc\n");//此时\n组合的意思是换行
//	return 0;
//}
//********************************************************************
//int main()
//{
//	char arr1[] = "abc";
//	char arr2[] = { 'a','b','c',};
//	printf("%d\n", strlen(arr1));//strlen = string length = 计算字符串长度的
//	printf("%d\n", strlen(arr2));
//	return 0;
//	//打印结果3  随机值
//}

//********************************************************************
//int main()
//{
//	//数据在计算机上存储的时候，存储的是2进制
//	// #av$
//	//a - 97
//	//A - 65
//	//...
//	//ASCII 编码
//	//ASCII 码值
//	char arr1[] = "abc";//数组
//	//"abc"--'a' 'b' 'c' '\0'  -- '\0'是字符串的结束标志
//
//	char arr2[] = {'a', 'b', 'c','\0'};
//	//'0' - 0
//	//'a' - 97
//	//'a' 'b' 'c'
//	printf("%s\n", arr1);
//	printf("%s\n", arr2);//以%s字符串的形式打印
//	//"hello bit.\n"
//	// 这种由双引号引起来的一串字符称为字符串字面值，或者简称字符串。
//	//注：字符串的结束标志是一个\0的 转义字符。在计算字符串长度的时候是\0是结束标志，不算做字符串内容
//	return 0;
//}

//int float
//char
//字符串类型
//int main()
//{
//	"abcdef";
//	"hello bit";
//	"";//空字符串
//
//	return 0;
//}


//********************************************************************
//#include<stdio.h>
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int sum = 0;
//	scanf("%d%d", &a, &b);
//	//scanf是C语言提供的，scanf_s不是标准C语言提供的，是VS编译器提供的。
//	sum = a + b;
//	printf("sum=%d\n", sum);
//
//	return 0;
//}
//********************************************************************
//int main()
//{
//	//2.const - 常属性
//	const int n = 10;//n是变量，但是又有常属性，所以说n是常变量
//	/*int arr[n] = {0};*/
//	n = 20;
//	
//	//const修饰的常变量
//	/*const int a = 4;
//	printf("%d\n", a);
//	a = 8;
//	printf("%d\n", a);*/
//	//1.字面常量
//	/*3;
//	100;
//	3.14;*/
//	return 0;
//}
//********************************************************************
#include<stdio.h>
//4.枚举常量 枚举=一一列举
//例：性别：男、女、保密；
//    三原色：红黄蓝； 
//    星期：1、2、3、4、5、6、7；

//枚举关键字 - enum

//enum Color
//{
//	red,
//	yellow,
//	blue
//};
//
//int main()
//{
//	
//	enum Color color = blue;
//	color = yellow;
//	//大括号中的给定枚举常量是不能修改的，但是通过枚举的类型所创建的变量是可以修改的。
//	//blue = 6;//err
//	return 0;
//}
//enum sex
//{
//	male,
//	female,
//	secret
//};
//
//int main()
//{
//	/*enum sex s = female;*/
//	printf("%d\n", male);  //0
//	printf("%d\n", female);//1
//	printf("%d\n", secret);//2
//	return 0;
//}

//3.#define - 定义的标识符常量
//#define MAX 10
//int main()
//{
//	int arr[MAX] = { 0 };
//	printf("%d\n", MAX);
//	return 0;
//}
